otvortex/snake-msp430/main (2).c
#include <msp430g2533.h>
#include <msp430.h>

//define pins used for
#define DATA BIT0 // DS -> 1.0
#define CLOCK BIT4 // SH_CP -> 1.4
#define LATCH BIT5 // ST_CP -> 1.5
#define ENABLE BIT6 // OE -> 1.6

// The OE pin can be tied directly to ground, but controlling
// it from the MCU lets you turn off the entire array without
// zeroing the register

// Declare functions pertaining to displaying LED's
void pulseClock ( void );
void shiftOut ( unsigned char );
void enable ( void );
void disable ( void );
void init ( void );
void pinWrite ( unsigned int, unsigned char );
void latchOn( void );
void latchOff (void );
int concatenate( int[] );
void reset( void );

//Declare functions pertaining to backend code (actual game)
void generateInitial( void );		//generates first dot
void runSnake( void );				//main function to run game

//function that increment game forward based on direction of head of snake:
void incrementUp( void );
void incrementRight( void );
void incrementDown( void );
void incrementLeft( void );

//functions to check whether reached edge of board
int checkBoundaryUp( void );
int checkBoundaryRight( void );
int checkBoundaryDown( void );
int checkBoundaryLeft( void );

void takeTurn( void );
void convertArrays( void );		//converts array containing game to array that will be displayed,
								//		based on hardware configuration of LED's connected to pins
								//		of the shift registers

void addToLength( void );		//adds one to the length of the snake when eating an apple
void updateDir( void );			//updates array of directions of each piece of the snake
void move( void );				//moves snake forward on pixel
int eat( void );				//eats the next apple if it encounters on
void deleteTail( void );		//deletes tail of snake after its moved forward one
void createNewApple();			//creates new random apple

//initialize array of directions of snake pieces
volatile unsigned int directionArr[64] = {0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0,
										  0, 0, 0, 0, 0, 0, 0, 0};

volatile unsigned int snakeLength;		//current length of snake
volatile unsigned int state = 0; 		//if 0, game paused; if 1 game running;
volatile unsigned int dir; 				//1 = up, 2 = right, 3 = down, 4 = left
volatile unsigned int headX; 			//x coordinate of head position
volatile unsigned int headY; 			//y coordinate of head postion
volatile unsigned int tailX; 			//x coordinate of tail position
volatile unsigned int tailY; 			//y coordinate of tail position
volatile unsigned int dirTail; 			//current direction of the tail movement


volatile unsigned int display_counter;	//interval of timer for refreshing display
unsigned int timerCount = 16;

//internal debounce "button_pressed" variables for 4 buttons
volatile unsigned int button_1_pressed = 0;
volatile unsigned int button_2_pressed = 0;
volatile unsigned int button_3_pressed = 0;
volatile unsigned int button_4_pressed = 0;

//initialize array containing actual game info:
volatile unsigned int arr[8][8] = {0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0,
								   0, 0, 0, 0, 0, 0, 0, 0};

//initialize array displaying game:
volatile unsigned int arrToPrint[8][8] = {{1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1},
   	     	     	     	    		  {1, 1, 1, 1, 1, 1, 1, 1}};

volatile unsigned int randomX;
volatile unsigned int randomY;
volatile unsigned int randomInt = 0;

//convers arrays from "arr" containing game info to hardware-based "arrToPrint", to display it on LED's
void convertArrays( void ) {
	arrToPrint[1][7] = arr[0][0];
	arrToPrint[7][0] = arr[0][1];
	arrToPrint[7][2] = arr[0][2];
	arrToPrint[7][1] = arr[0][3];
	arrToPrint[2][7] = arr[0][4];
	arrToPrint[4][0] = arr[0][5];
	arrToPrint[4][2] = arr[0][6];
	arrToPrint[4][1] = arr[0][7];
	arrToPrint[1][5] = arr[1][0];
	arrToPrint[1][6] = arr[1][1];
	arrToPrint[7][4] = arr[1][2];
	arrToPrint[7][3] = arr[1][3];
	arrToPrint[2][5] = arr[1][4];
	arrToPrint[2][6] = arr[1][5];
	arrToPrint[4][4] = arr[1][6];
	arrToPrint[4][3] = arr[1][7];
	arrToPrint[1][3] = arr[2][0];
	arrToPrint[1][4] = arr[2][1];
	arrToPrint[7][6] = arr[2][2];
	arrToPrint[7][5] = arr[2][3];
	arrToPrint[2][3] = arr[2][4];
	arrToPrint[2][4] = arr[2][5];
	arrToPrint[4][6] = arr[2][6];
	arrToPrint[4][5] = arr[2][7];
	arrToPrint[1][1] = arr[3][0];
	arrToPrint[1][2] = arr[3][1];
	arrToPrint[6][0] = arr[3][2];
	arrToPrint[7][7] = arr[3][3];
	arrToPrint[2][1] = arr[3][4];
	arrToPrint[2][2] = arr[3][5];
	arrToPrint[5][0] = arr[3][6];
	arrToPrint[4][7] = arr[3][7];
	arrToPrint[0][7] = arr[4][0];
	arrToPrint[1][0] = arr[4][1];
	arrToPrint[6][2] = arr[4][2];
	arrToPrint[6][1] = arr[4][3];
	arrToPrint[3][7] = arr[4][4];
	arrToPrint[2][0] = arr[4][5];
	arrToPrint[5][2] = arr[4][6];
	arrToPrint[5][1] = arr[4][7];
	arrToPrint[0][5] = arr[5][0];
	arrToPrint[0][6] = arr[5][1];
	arrToPrint[6][4] = arr[5][2];
	arrToPrint[6][3] = arr[5][3];
	arrToPrint[3][5] = arr[5][4];
	arrToPrint[3][6] = arr[5][5];
	arrToPrint[5][4] = arr[5][6];
	arrToPrint[5][3] = arr[5][7];
	arrToPrint[0][3] = arr[6][0];
	arrToPrint[0][4] = arr[6][1];
	arrToPrint[6][6] = arr[6][2];
	arrToPrint[6][5] = arr[6][3];
	arrToPrint[3][3] = arr[6][4];
	arrToPrint[3][4] = arr[6][5];
	arrToPrint[5][6] = arr[6][6];
	arrToPrint[5][5] = arr[6][7];
	arrToPrint[0][1] = arr[7][0];
	arrToPrint[0][2] = arr[7][1];
	arrToPrint[0][0] = arr[7][2];
	arrToPrint[6][7] = arr[7][3];
	arrToPrint[3][1] = arr[7][4];
	arrToPrint[3][2] = arr[7][5];
	arrToPrint[3][0] = arr[7][6];
	arrToPrint[5][7] = arr[7][7];
}

int main(){
	// setup the watchdog timer as an interval timer
	WDTCTL =(WDTPW + 	  // (bits 15-8) password
						  // bit 7=0 => watchdog timer on
						  // bit 6=0 => NMI on rising edge (not used here)
						  // bit 5=0 => RST/NMI pin does a reset (not used here)

				WDTTMSEL + 		// (bit 4) select interval timer mode
				WDTCNTCL +  	// (bit 3) clear watchdog timer counter
						0 		// bit 2=0 => SMCLK is the source
						+1 		// bits 1-0 = 01 => source/8K
			);
	IE1 |= WDTIE;	// enable the WDT interrupt (in the system interrupt register IE1)

	CCTL0 = CCIE;
	TACTL = TASSEL_2 + MC_2; // Set the timer A to SMCLCK, Continuous
	__enable_interrupt();	// Clear the timer and enable timer interrupt

	P1OUT=BIT1;		//set pin 1.1 as input
	P1REN=BIT1;		//enable P1.1 pull resistor
	P1OUT=BIT2;		//set pin 1.2 as input
	P1REN=BIT2;		//enable P1.2 pull resistor
	P2OUT=BIT5;		//set pin 2.5 as input
	P2REN=BIT5;   	//enable P2.5 pull resistor
	P1OUT=BIT7;		//set pin 1.7 as input
	P1REN=BIT7;		//enable P1.7 pull resistor

	P1DIR |= (DATA + CLOCK + LATCH + ENABLE);  // Setup pins as outputs
	enable(); // Enable output (pull OE low)

	//initialize interval time counter for display refresh
	display_counter = 10;

	//initialize snake length for first dot
	snakeLength = 1;

	//initialize first dot of snake
	generateInitial();

	//creates new first apple
	createNewApple();

	//set initial direction to some number 1-4
	dir = 2;

	//initialize game to state = 1, means running
	state = 1;

	//Enter Low Power Mode 0 with interrupts enabled
	while (1)
	{
		__bis_SR_register(LPM0 + GIE);
	}
}

// ===== Watchdog Timer Interrupt Handler =====
// This event handler is called to handle the watchdog timer interrupt,
//    which is occurring regularly at intervals of about 8K/1.1MHz ~= 7.4ms.
interrupt void WDT_interval_handler(){
	if(!state)	{
		reset();
	}

	randomInt++;
  if (--display_counter==0){          // decrement the counter and act only if it has reached 0
	  display_counter = 10;			//reset counter to display refresh interval

	  //covnert "arr" array, which contains contents of game, to the array that needs to be displayed
	  convertArrays();

	  //procedure to print array on board: latchOff registers, push all 8 bytes, one by one, cancatanating each, with shiftOut, then latchOn
	  int i;
	  latchOff();
	  for (i = 7; i >= 0; i--) {
		  shiftOut(concatenate(arrToPrint[i]));
	  }
	  latchOn();

  }

  //check for button pressed for each button, debounced, and generates pseudo-random X and Y based on timing of button press
  if(P1IN & BIT1)	{
	  randomX = randomInt%8;
	  button_1_pressed = 1;
  }
  else if(button_1_pressed == 1)	{
	  randomY = randomInt%8;
	  button_1_pressed = 0;
	  dir = 1;
	  //takeTurn();
  }

  if(P1IN & BIT2)	{
	randomX = randomInt%8;
    button_2_pressed = 1;
    }
  else if(button_2_pressed == 1)	{
	  randomY = randomInt%8;
	  button_2_pressed = 0;
	  dir = 2;
	  //takeTurn();
  }

  if(P2IN & BIT5)	{
	  randomX = randomInt%8;
	  button_3_pressed = 1;
  }
  else if(button_3_pressed == 1)	{
	  randomY = randomInt%8;
	  button_3_pressed = 0;
	  dir = 3;
	  //takeTurn();
  }

  if(P1IN & BIT7)	{
	  randomX = randomInt%8;
	  button_4_pressed = 1;
  }
  else if(button_4_pressed == 1)	{
	  randomY = randomInt%8;
	  button_4_pressed = 0;
	  dir = 4;
	  //takeTurn();
  }
}
// DECLARE function WDT_interval_handler as handler for interrupt 10
// using a macro defined in the msp430g2553.h include file
ISR_VECTOR(WDT_interval_handler, ".int10")

#pragma vector = TIMER0_A0_VECTOR
__interrupt void Timer_A(void)
{
	if(--timerCount ==0) {
		timerCount = 6;
		takeTurn();
	}

}

//increments game one turn by updating directions and running snake
void takeTurn( void ) {
	updateDir();
	runSnake();
}

//concatenates one row of "arr" for pushing it into shift registers as a byte
int concatenate(int inputArr[8]) {
	char i;
	int res = 0;
	for(i = 0; i < 8; i++) {
		res = (res << 1) + (inputArr[i] > 0);
	}
	return(res);
}

void reset( void ) {
	int i;
	int j;
	for(i = 7; i >= 0; i--) {
		for(j = 7; j >= 0; j--)	{
			arr[i][j] = 0;
		}
	}
	//initialize snake length for first dot
	snakeLength = 1;

	//initialize first dot of snake
	generateInitial();

	//creates new first apple
	createNewApple();

	//set initial direction to some number 1-4
	dir = 2;

	//initialize game to state = 1, means running
	state = 1;
}


// Writes a value to the specified bitmask/pin. Use built in defines

// when calling this, as the shiftOut() function does.

// All nonzero values are treated as "high" and zero is "low"

void pinWrite( unsigned int bit, unsigned char val )

{

  if (val){

    P1OUT |= bit;

  } else {

    P1OUT &= ~bit;

  }

}



// Pulse the clock pin

void pulseClock( void )

{

  P1OUT |= CLOCK;

  P1OUT ^= CLOCK;



}

/*

// Take the given 8-bit value and shift it out, LSB to MSB

void shiftOut(unsigned char val)

{

  //Set latch to low (should be already)

  P1OUT &= ~LATCH;



  char i;



  // Iterate over each bit, set data pin, and pulse the clock to send it

  // to the shift register

  for (i = 0; i < 8; i++)  {

      pinWrite(DATA, (val & (1 << i)));

      pulseClock();

  }



  // Pulse the latch pin to write the values into the storage register

  P1OUT |= LATCH;

  P1OUT &= ~LATCH;

}*/



// set latch off to enable Shifting bits in

void latchOff( void )

{

   //Set latch to low (should be already)

   P1OUT &= ~LATCH;

}



// set latch on to set bits in output

void latchOn( void )

{

    // Pulse the latch pin to write the values into the storage register

    P1OUT |= LATCH;

    P1OUT &= ~LATCH;

}



// Take the given 8-bit value and shift it out, LSB to MSB

void shiftOut(unsigned char val)

{



  char i;



  // Iterate over each bit, set data pin, and pulse the clock to send it

  // to the shift register

  for (i = 0; i < 8; i++)  {

      pinWrite(DATA, (val & (1 << i)));

      pulseClock();

  }



}



// These functions are just a shortcut to turn on and off the array of

// LED's when you have the enable pin tied to the MCU. Entirely optional.

void enable( void )

{

  P1OUT &= ~ENABLE;

}



void disable( void )	{
  P1OUT |= ENABLE;
}





void updateDir() {
	int i;
	if(snakeLength > 1) {
		for(i = snakeLength-2; i >= 0; i--) {
				directionArr[i+1]=directionArr[i];
		}
	}
	directionArr[0] = dir;
}



//Generates the initial coordinates of the snake head

void generateInitial() {
	headX = 3; //rand() % 8;
	headY = 3; //rand() % 8;
	tailX = headX;
	tailY = headY;
	if(arr[headX][headY] == 0) {
		arr[headX][headY] = 2;
	}
	else {
		generateInitial();
	}
}



//Main run, checks boundaries, wins, increments forward
void runSnake() {
	switch(dir) {
		case 1: //up
			if(checkBoundaryUp()) {
				//printf("GAME OVER\n");
				state = 0; // state 0 = game over
			}
			else
				incrementUp();
			break;
		case 2: //right
			if(checkBoundaryRight()) {
				//printf("GAME OVER\n");
				state = 0;
			}
			else
				incrementRight();
			break;
		case 3: //down
			if(checkBoundaryDown()) {
				//printf("GAME OVER\n");
				state = 0;
			}
			else
				incrementDown();
			break;
		case 4: //left
			if(checkBoundaryLeft()) {
				//printf("GAME OVER\n");
				state = 0;
			}
			else
				incrementLeft();
			break;
	}
}



void addToLength() {
	snakeLength++;
	if(snakeLength >= 3) {
		directionArr[snakeLength-1] = directionArr[snakeLength-2];
	}
}



void incrementUp() {
	if(eat()) {
		arr[headX][headY] = 1;
		headY--;
		arr[headX][headY] = 2;
		addToLength();
		createNewApple();
	}
	else {
		move();
	}
}



void incrementRight() {
	if(eat()) {
		arr[headX][headY] = 1;
		headX++;
		arr[headX][headY] = 2;
		addToLength();
		createNewApple();
	}
	else {
		move();
	}
}



void incrementDown() {
	if(eat()) {
		arr[headX][headY] = 1;
		headY++;
		arr[headX][headY] = 2;
		addToLength();
		createNewApple();
	}
	else {
		move();
	}
}

void incrementLeft() {
	if(eat()) {
		arr[headX][headY] = 1;
		headX--;
		arr[headX][headY] = 2;
		addToLength();
		createNewApple();
	}
	else {
		move();
	}
}



int checkBoundaryUp() {
	return(headY == 0);
}

int checkBoundaryRight() {
	return(headX == 7);
}

int checkBoundaryDown() {
	return(headY == 7);
}

int checkBoundaryLeft() {
	return(headX == 0);
}

int eat() {
	switch(dir) {
		case 1:		//eats up
			if(arr[headX][headY-1] == 4) {
				return 1;
			}
			else if(arr[headX][headY-1] != 0) {
				//printf("GAME OVER\n");
				state = 0;
			}
			break;
		case 2:		//eats right
			if(arr[headX+1][headY] == 4) {
				return 1;
			}
				else if(arr[headX+1][headY] != 0) {
				//printf("GAME OVER\n");
					state = 0;
			}
			break;
		case 3:		//eats down
			if(arr[headX][headY+1] == 4) {
				return 1;
			}
			else if(arr[headX][headY+1] != 0) {
				//printf("GAME OVER\n");
				state = 0;
			}
			break;
		case 4:		//eats left
			if(arr[headX-1][headY] == 4) {
				return 1;
			}
			else if(arr[headX-1][headY] != 0) {
				//printf("GAME OVER\n");
				state = 0;
			}
			break;
	}
	return 0;
}

void move() {
		switch(dir) {
		case 1:
			arr[headX][headY] = 1;
			headY--;
			arr[headX][headY] = 2;
			break;
		case 2:
			arr[headX][headY] = 1;
			headX++;
			arr[headX][headY] = 2;
			break;
		case 3:
			arr[headX][headY] = 1;
			headY++;
			arr[headX][headY] = 2;
			break;
		case 4:
			arr[headX][headY] = 1;
			headX--;
			arr[headX][headY] = 2;
			break;
	}
	deleteTail();
}

void deleteTail() {
	switch(directionArr[snakeLength-1]) {
		case 1:
			arr[tailX][tailY] = 0;
			tailY--;
			arr[tailX][tailY] = 3;
			break;
		case 2:
			arr[tailX][tailY] = 0;
			tailX++;
			arr[tailX][tailY] = 3;
			break;
		case 3:
			arr[tailX][tailY] = 0;
			tailY++;
			arr[tailX][tailY] = 3;
			break;
		case 4:
			arr[tailX][tailY] = 0;
			tailX--;
			arr[tailX][tailY] = 3;
			break;
	}
}



//volatile unsigned int random=0;
volatile unsigned int randomTemp;

void createNewApple() {
	unsigned int i, j;
	int random = 0;
	random = (randomX+1)*(randomY+1);
	for( i = 0; i < 8; i++ ) {
		for( j = 0; j < 8; j++) {
			if(!(arr[i][j])) {
				if(!(random--))	{
					arr[i][j] = 4; // place new apple
				}

			}
		}
	}
	randomTemp = random;
}



